ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adxl362/adxl_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         adxl_task.c
* @author       ADI
* @version      V1.0.0
* @date         26-Nov-2020
* @brief        Source file contains adxl processing wrapper.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/
/* -------------------------------- Includes --------------------------------*/
#include "adxl362.h"
#include "sensor_adxl_application_interface.h"
#include "us_tick.h"
#include <adxl_buffering.h>
#include <adxl_dcfg.h>
#include <adxl_task.h>
#include <clock_calibration.h>
#include <common_application_interface.h>
#include <includes.h>
#ifdef ENABLE_PEDO_APP
#include <pedometer_task.h>
#endif
#include <rtc.h>
#include "adpd400x_lib.h"
#include <app_common.h>

#ifdef DCB
#include <dcb_interface.h>
#endif

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
/*--------------------------- Defines ---------------------------------------*/
#define ADXL_APP_ROUTING_TBL_SZ                                                \
  (sizeof(adxl_app_routing_table) / sizeof(adxl_app_routing_table[0]))

/*--------------------------- Typedefs --------------------------------------*/

typedef m2m2_hdr_t *(app_cb_function_t)(m2m2_hdr_t *);

/*!
 * @brief:  The dictionary type for mapping addresses to callback handlers.
 */
typedef struct _app_routing_table_entry_t {
  uint8_t command;
  app_cb_function_t *cb_handler;
} app_routing_table_entry_t;

/*-------------------------- Public Variables -------------------------------*/
extern ADXL_TS_DATA_TYPE gADXL_dready_ts;
int16_t g_accelExists = -2;
#ifdef ENABLE_PPG_APP
extern uint32_t Ppg_Slot;
#endif
#ifdef ENABLE_PEDO_APP
extern uint32_t pedometer_event;
#endif
/*! This variable used for indicating the frequency of adxl samples*/
extern uint8_t gAdxlFreqSelected;
/*-------------------------- Public Function Prototype ----------------------*/

int32_t AdxlInit(void);
extern void AdxlFifoCallBack(void);
extern void SyncAppDataSend(uint32_t *p_data, uint32_t adpdtimestamp,
    int16_t *pAdxlData, uint32_t adxltimestamp);
/*-------------------------- Private Variables ------------------------------*/
/* Create the stack for task */
static uint8_t sensor_adxl_task_stack[APP_OS_CFG_SENSOR_ADXL_TASK_STK_SIZE];

/* Create handler for task */
static ADI_OSAL_THREAD_HANDLE sensor_adxl_task_handler;

/* Create task attributes variable */
static ADI_OSAL_STATIC_THREAD_ATTR sensor_adxl_task_attributes;

/* Create TCB for task */
static StaticTask_t adxlTaskTcb;

/* Create semaphores */
static ADI_OSAL_SEM_HANDLE adxl_task_evt_sem;

/* Create Queue Handler for task */
static ADI_OSAL_QUEUE_HANDLE adxl_task_msg_queue = NULL;

/* ADXL VERSION STRING variable*/
const char GIT_ADXL_VERSION[] = "TEST ADXL_VERSION STRING";
/* ADXL VERIOSN STRING size variable*/
const uint8_t GIT_ADXL_VERSION_LEN = sizeof(GIT_ADXL_VERSION);

/* structure varible for storing the adxl app states*/
g_state_adxl_t g_state_adxl;

volatile uint8_t gsOneTimeValueWhenReadAdxlData = 0;
uint16_t gnAdxlODR;
/* counter used to send every kth sample to HR algo
   to have ppg odr = 50Hz, where k = odr of adxl*/
uint32_t gnHRAdxlSampleCount = 0;
extern Adpd400xLibConfig_t gAdpd400xLibCfg;
extern volatile uint8_t gn_uc_hr_enable;
extern volatile uint8_t gnAppSyncTimerStarted;
extern bool gRun_agc;
/*-------------------------- Private Function Prototype ---------------------*/

static void packetize_adxl_raw_data_no_compress(int16_t *p_data, uint32_t len,
    m2m2_sensor_adxl_data_no_compress_stream_t *pPkt, uint32_t timestamp);
static m2m2_hdr_t *adxl_app_reg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_app_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_app_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_app_load_cfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_app_get_dcfg(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_app_get_version(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_app_decimation(m2m2_hdr_t *p_pkt);
#ifdef DCB
static m2m2_hdr_t *adxl_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *adxl_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif
static m2m2_hdr_t *adxl_do_self_test(m2m2_hdr_t *p_pkt);
static void adxl_data_ready_cb(void);
static void fetch_adxl_data(void);
static void sensor_adxl_task(void *pArgument);
static int32_t AdxlSampleMode(void);
static uint16_t gnAdxlSequenceCount = 0;

/* Table which maps adxl commands to the callback functions*/
app_routing_table_entry_t adxl_app_routing_table[] = {
    {M2M2_APP_COMMON_CMD_STREAM_START_REQ, adxl_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, adxl_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, adxl_app_stream_config},
    {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, adxl_app_stream_config},
    {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, adxl_app_status},
    {M2M2_SENSOR_COMMON_CMD_GET_DCFG_REQ, adxl_app_get_dcfg},
    {M2M2_SENSOR_ADXL_COMMAND_LOAD_CFG_REQ, adxl_app_load_cfg},
    {M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ, adxl_app_reg_access},
    {M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ, adxl_app_reg_access},
    {M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ, adxl_app_decimation},
    {M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ, adxl_app_decimation},
    {M2M2_APP_COMMON_CMD_GET_VERSION_REQ, adxl_app_get_version},
#ifdef DCB
    {M2M2_DCB_COMMAND_READ_CONFIG_REQ, adxl_dcb_command_read_config},
    {M2M2_DCB_COMMAND_WRITE_CONFIG_REQ, adxl_dcb_command_write_config},
    {M2M2_DCB_COMMAND_ERASE_CONFIG_REQ, adxl_dcb_command_delete_config},
#endif
    {M2M2_SENSOR_ADXL_COMMAND_SELF_TEST_REQ, adxl_do_self_test},
};

/**
 * @brief  Initializes the adxl task
 *
 * @param[in]  None
 *
 * @return     None
 *
 */
void sensor_adxl_task_init(void) {
  /* Initialize app state */
  g_state_adxl.num_subs = 0;
  g_state_adxl.num_starts = 0;
  /* Default behaviour is to send every packet */
  g_state_adxl.decimation_factor = 1;
  g_state_adxl.decimation_nsamples = 0;
  g_state_adxl.data_pkt_seq_num = 0;

  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  sensor_adxl_task_attributes.pThreadFunc = sensor_adxl_task;
  sensor_adxl_task_attributes.nPriority = APP_OS_CFG_SENSOR_ADXL_TASK_PRIO;
  sensor_adxl_task_attributes.pStackBase = &sensor_adxl_task_stack[0];
  sensor_adxl_task_attributes.nStackSize = APP_OS_CFG_SENSOR_ADXL_TASK_STK_SIZE;
  sensor_adxl_task_attributes.pTaskAttrParam = NULL;
  sensor_adxl_task_attributes.szThreadName = "ADXL Sensor";

