ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adxl362/adxl_task.c
  sensor_adxl_task_attributes.pThreadTcb = &adxlTaskTcb;
  eOsStatus = adi_osal_MsgQueueCreate(&adxl_task_msg_queue, NULL, 25);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_ADXL_TASK_INDEX, adxl_task_msg_queue);
  }
  eOsStatus = adi_osal_ThreadCreateStatic(
      &sensor_adxl_task_handler, &sensor_adxl_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }
}

/**
 * @brief  Posts the message packet received into the Adxl task queue
 *
 * @param[in]  p_pkt: m2m2_hdr_t pointer to the message to be posted
 *
 * @return None
 */
void send_message_adxl_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(adxl_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(adxl_task_evt_sem);
}

/**
 * @brief  Task which handles processing of the adxl data and commands received
 *
 * @param[in]  pArgument: input argument to the task
 *
 * @return None
 */
static void sensor_adxl_task(void *pArgument) {
  m2m2_hdr_t *p_in_pkt = NULL;
  m2m2_hdr_t *p_out_pkt = NULL;
  ADI_OSAL_STATUS err;

  adi_osal_SemCreate(&adxl_task_evt_sem, 0);
  AdxlDrvDataReadyCallback(adxl_data_ready_cb);
  AdxlInit();
  if (load_adxl_cfg(362) != ADXL_DCB_STATUS_OK) {
    /*device id ==362 ,bcz of ADXL362 is a sensor model.*/
    Debug_Handler(); /*exception handler */
  }
  /*  AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_ENABLE); */
  /*keeping the adxl interrupt P0.31 interrupt prio <
   * configMAX_SYSCALL_INTERRUPT_PRIORITY (3)*/
  /* NVIC_SetPriority(GPIOTE_IRQn,4); */
  //ret_code_t err_code = sd_nvic_SetPriority(GPIOTE_IRQn, APP_IRQ_PRIORITY_MID);
  GPIO_IRQ_ADXL362_Enable();

  post_office_add_mailbox(M2M2_ADDR_SENSOR_ADXL, M2M2_ADDR_SENSOR_ADXL_STREAM);
  while (1) {
    adi_osal_SemPend(adxl_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    p_in_pkt =
        post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_ADXL_TASK_INDEX);
    if (p_in_pkt == NULL) {
      /* No m2m2 messages to process, so fetch some data from the device. */
      fetch_adxl_data();
    } else {
      /* We got an m2m2 message from the queue, process it. */
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      /* Look up the appropriate function to call in the function table */
      for (int i = 0; i < ADXL_APP_ROUTING_TBL_SZ; i++) {
        if (adxl_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = adxl_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    }
  }
}

/**
 * @brief  Resets the adxl packetization process
 *
 * @param[in]  None
 *
 * @return     None
 */
static void reset_adxl_packetization(void) {
  g_state_adxl.adxl_pktizer.packet_nsamples = 0;
}

volatile int gDebugVar2 = 0;
/**
 * @brief  Fetches the adxl data from device and does the data packetization
 *
 * @param[in]  None
 *
 * @return     None
 */
static void fetch_adxl_data(void) {

  ADI_OSAL_STATUS err;

  g_state_adxl.adxl_pktizer.p_pkt = NULL;
  uint8_t pnRData[6] = {0, 0, 0, 0, 0, 0};
  uint32_t nlen = 6; /* 3 axis data each of 2 bytes size */
  ADXL_TS_DATA_TYPE current_ts = 0;
  CIRC_BUFF_STATUS_t status;
  static m2m2_sensor_adxl_data_no_compress_stream_t adxlpkt;

  if (gsOneTimeValueWhenReadAdxlData == 0) {
    GetAdxlOutputRate(&gnAdxlODR);
    gsOneTimeValueWhenReadAdxlData = 1;
  }

  adxl_read_data_to_buffer();
  status = adxl_buff_get(pnRData, &current_ts, &nlen);

  while (status == CIRC_BUFF_STATUS_OK) {
#ifdef ENABLE_PPG_APP
    //Collect data for HR algo in UC 1,2,3,5
    if (gn_uc_hr_enable && !gRun_agc) {
      if(++gnHRAdxlSampleCount == (gnAdxlODR / gAdpd400xLibCfg.hrmInputRate))
      {
          gnHRAdxlSampleCount = 0;
          SyncAppDataSend(0, 0, (int16_t *)&pnRData, current_ts);
      }
    }
    /* Check the slot is in PPG mode */
    else if (Ppg_Slot != 0) {
      SyncAppDataSend(0, 0, (int16_t *)&pnRData, current_ts);
    }
#endif
#ifdef ENABLE_PEDO_APP
    if (pedometer_event == 1) {
      send_pedometer_app_data((int16_t *)&pnRData, current_ts);
    }
#endif
    if(g_state_adxl.num_subs != 0)
    {
      g_state_adxl.decimation_nsamples++;
      if (g_state_adxl.decimation_nsamples >= g_state_adxl.decimation_factor) {
        g_state_adxl.decimation_nsamples = 0;
        packetize_adxl_raw_data_no_compress(
            (int16_t *)&pnRData, 3, &adxlpkt, current_ts);
        if (g_state_adxl.adxl_pktizer.packet_nsamples >
            g_state_adxl.adxl_pktizer.packet_max_nsamples) {
          adi_osal_EnterCriticalRegion();
          g_state_adxl.adxl_pktizer.p_pkt = post_office_create_msg(
              sizeof(m2m2_sensor_adxl_data_no_compress_stream_t) +
              M2M2_HEADER_SZ);
          if (g_state_adxl.adxl_pktizer.p_pkt != NULL) {
            PYLD_CST(g_state_adxl.adxl_pktizer.p_pkt,
                m2m2_sensor_adxl_data_no_compress_stream_t, p_payload_ptr);
            g_state_adxl.adxl_pktizer.p_pkt->src = M2M2_ADDR_SENSOR_ADXL;
            g_state_adxl.adxl_pktizer.p_pkt->dest = M2M2_ADDR_SENSOR_ADXL_STREAM;
            memcpy(&p_payload_ptr->command, &adxlpkt,
                sizeof(m2m2_sensor_adxl_data_no_compress_stream_t));
            p_payload_ptr->command = M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
            p_payload_ptr->status = 0x00;
            p_payload_ptr->sequence_num = gnAdxlSequenceCount++;
#ifdef DEBUG_PKT
            post_office_msg_cnt(g_state_adxl.adxl_pktizer.p_pkt);
#endif
            post_office_send(g_state_adxl.adxl_pktizer.p_pkt, &err);
            adi_osal_ExitCriticalRegion();
            g_state_adxl.adxl_pktizer.packet_nsamples = 0;
            g_state_adxl.adxl_pktizer.packet_max_nsamples = 0;
            g_state_adxl.adxl_pktizer.p_pkt = NULL;
          } else {
            gDebugVar2 = 1;
            adi_osal_ExitCriticalRegion(); /* exiting critical region even if
                                              mem_alloc fails*/
          }
        }
      }
    }//if(g_state_adxl.num_subs != 0)
    status = adxl_buff_get(pnRData, &current_ts, &nlen);
  }
}

/**
 * @brief  Packetizes the adxl raw data
 *
 * @param[in]  pAdxlData: Pointer to the adxl data buffer
 * @param[in]  len: length(size) of the adxl data buffer
 * @param[out] pPkt: pointer to the output data packet structure
 *                   m2m2_sensor_adxl_data_no_compress_stream_t
 *
 * @return     None
 */
static void packetize_adxl_raw_data_no_compress(int16_t *pAdxlData,
    uint32_t len, m2m2_sensor_adxl_data_no_compress_stream_t *pPkt,
    uint32_t timestamp) {
  uint32_t nOutDataCnt = 0;
  if (g_state_adxl.adxl_pktizer.packet_nsamples == 0) {
    g_state_adxl.adxl_pktizer.packet_max_nsamples =
        (sizeof(pPkt->adxldata) / sizeof(pPkt->adxldata[0]));
    pPkt->data_type = M2M2_SENSOR_RAW_DATA_ADXL;
    pPkt->timestamp = timestamp;
    pPkt->first_xdata = pAdxlData[nOutDataCnt];
    pPkt->first_ydata = pAdxlData[nOutDataCnt + 1];
    pPkt->first_zdata = pAdxlData[nOutDataCnt + 2];
    g_state_adxl.adxl_pktizer.packet_nsamples++;
  } else if (g_state_adxl.adxl_pktizer.packet_nsamples <=
             g_state_adxl.adxl_pktizer.packet_max_nsamples) {
    /*one packet =  five samples .first sample was added with header and
     * remaining 4 samples was added next to the header. */
    uint16_t i = g_state_adxl.adxl_pktizer.packet_nsamples - 1;
    if (timestamp <
        g_state_adxl.adxl_pktizer.prev_ts) /* handle day roll-over after 24hrs*/
    {
      /* MAX_RTC_TICKS_FOR_24_HOUR:- Max RTC Count value returned by
         get_sensor_timestamp() after 24hrs. Adding that value to have correct
         incTS value during day roll-over */
      pPkt->adxldata[i].incTS = MAX_RTC_TICKS_FOR_24_HOUR +
                                (timestamp - g_state_adxl.adxl_pktizer.prev_ts);
    } else {
      pPkt->adxldata[i].incTS = timestamp - g_state_adxl.adxl_pktizer.prev_ts;
    }
    pPkt->adxldata[i].xdata = pAdxlData[nOutDataCnt];
    pPkt->adxldata[i].ydata = pAdxlData[nOutDataCnt + 1];
    pPkt->adxldata[i].zdata = pAdxlData[nOutDataCnt + 2];
    g_state_adxl.adxl_pktizer.packet_nsamples++;
  }
  g_state_adxl.adxl_pktizer.prev_ts = timestamp;
}

/**
 * @brief  returns the adxl application version info
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure
 *
 * @return     p_resp_pkt: Pointer to the output m2m2 packet structure
 */
static m2m2_hdr_t *adxl_app_get_version(m2m2_hdr_t *p_pkt) {
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_version_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_version_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
    p_resp_payload->major = 0x03;
    p_resp_payload->minor = 0x04;
    p_resp_payload->patch = 0x03;
    memcpy(&p_resp_payload->verstr[0], "ADXL_App", 9);
    memcpy(&p_resp_payload->str[0], &GIT_ADXL_VERSION, GIT_ADXL_VERSION_LEN);
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  Puts the ADXL device into self test mode
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure
 *
 * @return     p_resp_pkt: Pointer to the output m2m2 packet structure
 */
static m2m2_hdr_t *adxl_do_self_test(m2m2_hdr_t *p_pkt) {
  uint8_t ret;
  uint16_t AdxlDrvSelfTest();
  ret = AdxlDrvSelfTest();
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adxl_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_adxl_resp_t, p_resp_payload);

