ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adxl362/adxl_task.c
    if (!ret)
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK; /* Test passed */
    else
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR; /* Test Failed */
    p_resp_payload->command = M2M2_SENSOR_ADXL_COMMAND_SELF_TEST_RESP;
    p_resp_payload->deviceid = M2M2_SENSOR_ADXL_DEVICE_362;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  loads the configuration settings to the ADXL device
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure
 *
 * @return     p_resp_pkt: Pointer to the output m2m2 packet structure
 */
static m2m2_hdr_t *adxl_app_load_cfg(m2m2_hdr_t *p_pkt) {
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_adxl_resp_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_adxl_resp_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_adxl_resp_t, p_resp_payload);
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    uint16_t device_id = p_in_payload->deviceid;

    if (g_state_adxl.num_starts == 0) {
      if (!load_adxl_cfg(device_id)) { /* Loads the device configuration */
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
      } else {
        p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
      }
    }
    p_resp_payload->deviceid = device_id;
    p_resp_payload->command = M2M2_SENSOR_ADXL_COMMAND_LOAD_CFG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  returns the ADXL stream status
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *adxl_app_status(m2m2_hdr_t *p_pkt) {
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

    p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

    if (g_state_adxl.num_starts == 0) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
    }
    p_resp_payload->stream = M2M2_ADDR_SENSOR_ADXL_STREAM;
    p_resp_payload->num_subscribers = g_state_adxl.num_subs;
    p_resp_payload->num_start_reqs = g_state_adxl.num_starts;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  Handles start/stop/sub/unsub of adxl data streams commands
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for stream start/stop/sub/unsub operations
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *adxl_app_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t command;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
      AdxlDrvDataReadyCallback(adxl_data_ready_cb);
      if (g_state_adxl.num_starts == 0) {
        gsOneTimeValueWhenReadAdxlData = 0;
        /* AdxlInit(); */
        reset_adxl_packetization();
        /*device id ==362 ,bcz of ADXL362 is a sensor model. */
        if (load_adxl_cfg(362) != ADXL_DCB_STATUS_OK) {
          Debug_Handler(); /* exception handler */
        }

        uint8_t nRegVal1;
        AdxlDrvRegRead(0x2C, &nRegVal1);
        gAdxlFreqSelected =
            nRegVal1 & 0x07; /*Check 0x2C reg & update timer freq */
        if (ADXLDrv_SUCCESS == AdxlSampleMode()) {
          uint16_t nRegVal2;
          Adpd400xDrvRegRead(0x0022, &nRegVal2);
          nRegVal2 = nRegVal2 & 0xFFC7;
          Adpd400xDrvRegWrite(
              0x0022, nRegVal2); /* To disable GPIO1 from adpd4k */
          uint8_t adxl_odr;
          adxl_odr = (GetFilterAdxl362() & 0x07);
          enable_adxl_ext_trigger(adxl_odr);
          g_state_adxl.num_starts = 1;
          status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
        } else {
          status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
        }
      } else {
        g_state_adxl.num_starts++;
        status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
      if (0 == g_state_adxl.num_starts) {
        status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
      } else if (1 == g_state_adxl.num_starts) {
        gsOneTimeValueWhenReadAdxlData = 0;
        uint8_t adxl_odr;
        adxl_odr = (GetFilterAdxl362() & 0x07);
        disable_adxl_ext_trigger(adxl_odr);
        AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_DISABLE);
        if (ADXLDrv_SUCCESS ==
            AdxlDrvSetOperationMode(PRM_MEASURE_STANDBY_MODE)) {
          reset_adxl_packetization();
          g_state_adxl.num_starts = 0;
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
        } else {
          g_state_adxl.num_starts = 1;
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
      } else {
        g_state_adxl.num_starts--;
        status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
      }
      command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
      break;

    case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
      g_state_adxl.num_subs++;
      post_office_setup_subscriber(M2M2_ADDR_SENSOR_ADXL,
          M2M2_ADDR_SENSOR_ADXL_STREAM, p_pkt->src, true);
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
      command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
      break;

