ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adxl362/adxl_task.c
    case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
      if (g_state_adxl.num_subs <= 1) {
        g_state_adxl.num_subs = 0;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
      } else {
        g_state_adxl.num_subs--;
        status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
      }
      post_office_setup_subscriber(M2M2_ADDR_SENSOR_ADXL,
          M2M2_ADDR_SENSOR_ADXL_STREAM, p_pkt->src, false);
      command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
      break;

    default:
      /* Something has gone horribly wrong. */
      post_office_consume_msg(p_resp_pkt);
      return NULL;
      break;
    }

    p_resp_payload->command = command;
    p_resp_payload->status = status;
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  } // if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/**
 * @brief  Handles ADXL register read/write commands
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for register read/write operation
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *adxl_app_reg_access(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t,
      p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_sensor_common_reg_op_16_hdr_t, p_resp_payload);
    uint8_t reg_data = 0;

    switch (p_in_payload->command) {
    case M2M2_SENSOR_COMMON_CMD_READ_REG_16_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (ADXLDrv_SUCCESS ==
            AdxlDrvRegRead(p_in_payload->ops[i].address, &reg_data)) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].address = p_in_payload->ops[i].address;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_READ_REG_16_RESP;
      break;
    case M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        NRF_LOG_INFO("ADXL reg w add:val=%x:%x",p_in_payload->ops[i].address,p_in_payload->ops[i].value);
        if (ADXLDrv_SUCCESS == AdxlDrvRegWrite(p_in_payload->ops[i].address,
                                   p_in_payload->ops[i].value)) {
          /*If ODR change is requested; set the adxl trigger pulse time
           * accordingly */
          if (p_in_payload->ops[i].address ==
              REG_FILTER_CTL) { /* reset packetization can be added? */
            set_adxl_trigger_freq(
                p_in_payload->ops[i].value &
                0x07); /*Last 3 bits give the frequency range */
            gsOneTimeValueWhenReadAdxlData = 0;
            gnAppSyncTimerStarted = 0;
          }
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].address = p_in_payload->ops[i].address;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_WRITE_REG_16_RESP;
      break;
    default:
      /* Something has gone horribly wrong*/
      post_office_consume_msg(p_resp_pkt);
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/**
 * @brief  Sets/returns the ADXL samples decimation factor
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for setting/getting the adxl samples decimation factor
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *adxl_app_decimation(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_OK;

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_sensor_common_decimate_stream_t, p_in_payload);
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_common_decimate_stream_t, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, m2m2_sensor_common_decimate_stream_t, p_resp_payload);

    switch (p_in_payload->command) {
    case M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_REQ:
      p_resp_payload->command =
          M2M2_SENSOR_COMMON_CMD_GET_STREAM_DEC_FACTOR_RESP;
      break;
    case M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_REQ:
      g_state_adxl.decimation_factor = p_in_payload->dec_factor;
      if (g_state_adxl.decimation_factor == 0) {
        g_state_adxl.decimation_factor = 1;
      }
      p_resp_payload->command =
          M2M2_SENSOR_COMMON_CMD_SET_STREAM_DEC_FACTOR_RESP;
      break;
    }
    p_resp_payload->status = status;
    p_resp_payload->dec_factor = g_state_adxl.decimation_factor;
    p_resp_payload->stream = p_in_payload->stream;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
  }
  return p_resp_pkt;
}

/**
 * @brief  Returns the ADXL Configuration settings decimation factor
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for getting adxl dcfg
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 *                         with adxl dcfg information
 */
static m2m2_hdr_t *adxl_app_get_dcfg(m2m2_hdr_t *p_pkt) {
  /* Declare and malloc a response packet */
  PKT_MALLOC(p_resp_pkt, m2m2_sensor_dcfg_data_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_sensor_dcfg_data_t, p_resp_payload);
    memset(p_resp_payload->dcfgdata, 0, sizeof(p_resp_payload->dcfgdata));
    /* Gets the device configuration */
    if (ADXL_DCFG_STATUS_OK ==
        read_adxl_dcfg(
            &p_resp_payload->dcfgdata[0], &p_resp_payload->size)) {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    } else {
      p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
    }
    p_resp_payload->command =
        (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_GET_DCFG_RESP;
    p_resp_payload->num_tx_pkts = 1;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/* Variable used for storing the current timestamp of interrupt event*/
uint32_t gadxl_dready_ts = 0;
/* Variable used for storing the previous timestamp of interrupt event*/
uint32_t gadxl_dready_ts_prev = 0;
/* Variable used for storing the timestamp difference between two consecutive
 * interrupt event*/
uint32_t g_adxltime_diff = 0;

/**
 * @brief  ADXL data ready interrupt callback function
 *
 * @param[in]  None
 *
 * @return     None
 */
#ifdef DEBUG_ADXL_TICKS
uint32_t g_adxl_isr_list[40] = {0};
uint8_t adxl_list_index = 0;
#endif
static void adxl_data_ready_cb(void) {
  gadxl_dready_ts = get_sensor_time_stamp();
#ifdef DEBUG_ADXL_TICKS
 g_adxl_isr_list[adxl_list_index++] = gadxl_dready_ts;
  if (adxl_list_index >=40)
    adxl_list_index =0;
#endif
  gADXL_dready_ts = gadxl_dready_ts;
  g_adxltime_diff = gadxl_dready_ts - gadxl_dready_ts_prev;
  gadxl_dready_ts_prev = gadxl_dready_ts;
  adi_osal_SemPost(adxl_task_evt_sem);
}

/**
 * @brief    Adxl sample mode
 * @param    None
 * @return   Success/Error
 */
int32_t AdxlSampleMode(void) {
  AdxlDrvSetOperationMode(PRM_MEASURE_MEASURE_MODE);
  AdxlDrvExtSampleMode(PRM_EXT_SAMPLE_ENABLE);
  return 0;
}

/**
 * @brief    Adxl device initialization
 * @param    None
 * @retval   Success/Error
 */
int32_t AdxlInit() {
  uint8_t nFifoWatermark = 4;
  uint16_t nAdpdOdr = 50;

  /* AdxlDrvDataReadyCallback(adxl_data_ready_cb); // AdxlFifoCallBack */
  adxl_buff_init();
  /* AdxlRxBufferInit(); */
  AdxlDrvOpenDriver(nAdpdOdr, nFifoWatermark);
  AdxlDrvSetOperationMode(PRM_MEASURE_STANDBY_MODE);
  return 0;
}

/*************************/

