ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adxl362/adxl_task.c
#ifdef DCB
/**
 * @brief  Returns the ADXL DCB configuration information from FDS
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for reading adxl dcb config information
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 *                         with adxl dcb config information
 */
static m2m2_hdr_t *adxl_dcb_command_read_config(m2m2_hdr_t *p_pkt) {
  static uint16_t r_size = 0;
  uint32_t dcbdata[MAXADXLDCBSIZE];
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_adxl_data_t, 0);
  if (NULL != p_resp_pkt) {
    /*  Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_adxl_data_t, p_resp_payload);
    memset(p_resp_payload->dcbdata, 0, sizeof(p_resp_payload->dcbdata));
    r_size = (uint16_t)MAXADXLDCBSIZE;
    if (read_adxl_dcb(&dcbdata[0], &r_size) == ADXL_DCB_STATUS_OK) {
      for (int i = 0; i < r_size; i++)
        p_resp_payload->dcbdata[i] = dcbdata[i];
      p_resp_payload->size = (r_size);
      status = M2M2_DCB_STATUS_OK;
    } else {
      p_resp_payload->size = 0;
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  Writes the ADXL DCB configuration information to FDS
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for writing adxl dcb config information
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *adxl_dcb_command_write_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
  uint32_t dcbdata[MAXADXLDCBSIZE];

  /* Declare a pointer to access the input packet payload */
  PYLD_CST(p_pkt, m2m2_dcb_adxl_data_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_adxl_data_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_adxl_data_t, p_resp_payload);

    for (int i = 0; i < p_in_payload->size; i++)
      dcbdata[i] = p_in_payload->dcbdata[i];
    if (write_adxl_dcb(&dcbdata[0], p_in_payload->size) == ADXL_DCB_STATUS_OK) {
      adxl_set_dcb_present_flag(true);
      status = M2M2_DCB_STATUS_OK;
    } else {
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i< MAXADXLDCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

/**
 * @brief  Deletes the ADXL DCB configuration information from FDS
 *
 * @param[in]  p_pkt: Pointer to the input m2m2 packet structure with command
 *                    for deleting adxl dcb config information
 *
 * @return     p_resp_pkt: Pointer to the output response m2m2 packet structure
 */
static m2m2_hdr_t *adxl_dcb_command_delete_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_adxl_data_t, 0);
  if (NULL != p_resp_pkt) {
    /* Declare a pointer to the response packet payload */
    PYLD_CST(p_resp_pkt, m2m2_dcb_adxl_data_t, p_resp_payload);

    if (delete_adxl_dcb() == ADXL_DCB_STATUS_OK) {
      adxl_set_dcb_present_flag(false);
      status = M2M2_DCB_STATUS_OK;
    } else {
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i< MAXADXLDCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }
  return p_resp_pkt;
}

#endif

/*@ **/